zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_dma.h
/*!
    \file    gd32c2x1_dma.h
    \brief   definitions for the DMA

    \version 2025-08-08, V1.1.0, firmware for gd32c2x1
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32C2X1_DMA_H
#define GD32C2X1_DMA_H

#include "gd32c2x1.h"

/* DMA definitions */
#define DMA                               DMA_BASE                                                            /*!< DMA base address */
#define DMAMUX                            DMAMUX_BASE                                                         /*!< DMAMUX base address */

/* registers definitions */
#define DMA_INTF                          REG32(DMA + 0x00000000U)                                            /*!< DMA interrupt flag register */
#define DMA_INTC                          REG32(DMA + 0x00000004U)                                            /*!< DMA interrupt flag clear register */

#define DMA_CH0CTL                        REG32(DMA + 0x00000008U)                                            /*!< DMA channel 0 control register */
#define DMA_CH0CNT                        REG32(DMA + 0x0000000CU)                                            /*!< DMA channel 0 counter register */
#define DMA_CH0PADDR                      REG32(DMA + 0x00000010U)                                            /*!< DMA channel 0 peripheral base address register */
#define DMA_CH0MADDR                      REG32(DMA + 0x00000014U)                                            /*!< DMA channel 0 memory base address register */

#define DMA_CH1CTL                        REG32(DMA + 0x0000001CU)                                            /*!< DMA channel 1 control register */
#define DMA_CH1CNT                        REG32(DMA + 0x00000020U)                                            /*!< DMA channel 1 counter register */
#define DMA_CH1PADDR                      REG32(DMA + 0x00000024U)                                            /*!< DMA channel 1 peripheral base address register */
#define DMA_CH1MADDR                      REG32(DMA + 0x00000028U)                                            /*!< DMA channel 1 memory base address register */

#define DMA_CH2CTL                        REG32(DMA + 0x00000030U)                                            /*!< DMA channel 2 control register */
#define DMA_CH2CNT                        REG32(DMA + 0x00000034U)                                            /*!< DMA channel 2 counter register */
#define DMA_CH2PADDR                      REG32(DMA + 0x00000038U)                                            /*!< DMA channel 2 peripheral base address register */
#define DMA_CH2MADDR                      REG32(DMA + 0x0000003CU)                                            /*!< DMA channel 2 memory base address register */

#define DMAMUX_RM_CH0CFG                  REG32(DMAMUX + 0x00000000U)                                         /*!< DMAMUX request multiplexer channel 0 configuration register */
#define DMAMUX_RM_CH1CFG                  REG32(DMAMUX + 0x00000004U)                                         /*!< DMAMUX request multiplexer channel 1 configuration register */
#define DMAMUX_RM_CH2CFG                  REG32(DMAMUX + 0x00000008U)                                         /*!< DMAMUX request multiplexer channel 2 configuration register */
#define DMAMUX_RM_INTF                    REG32(DMAMUX + 0x00000080U)                                         /*!< DMAMUX request multiplexer channel interrupt flag register */
#define DMAMUX_RM_INTC                    REG32(DMAMUX + 0x00000084U)                                         /*!< DMAMUX request multiplexer channel interrupt flag clear register */
#define DMAMUX_RG_CH0CFG                  REG32(DMAMUX + 0x00000100U)                                         /*!< DMAMUX generator channel 0 configuration register */
#define DMAMUX_RG_CH1CFG                  REG32(DMAMUX + 0x00000104U)                                         /*!< DMAMUX generator channel 1 configuration register */
#define DMAMUX_RG_CH2CFG                  REG32(DMAMUX + 0x00000108U)                                         /*!< DMAMUX generator channel 2 configuration register */
#define DMAMUX_RG_CH3CFG                  REG32(DMAMUX + 0x0000010CU)                                         /*!< DMAMUX generator channel 3 configuration register */
#define DMAMUX_RG_INTF                    REG32(DMAMUX + 0x00000140U)                                         /*!< DMAMUX generator channel interrupt flag register */
#define DMAMUX_RG_INTC                    REG32(DMAMUX + 0x00000144U)                                         /*!< DMAMUX rgenerator channel interrupt flag clear register */

