zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_dma.h
/* bits definitions */
/* DMA_INTF */
#define DMA_INTF_GIF                      BIT(0)                                                              /*!< global interrupt flag of channel */
#define DMA_INTF_FTFIF                    BIT(1)                                                              /*!< full transfer finish flag of channel */
#define DMA_INTF_HTFIF                    BIT(2)                                                              /*!< half transfer finish flag of channel */
#define DMA_INTF_ERRIF                    BIT(3)                                                              /*!< error flag of channel */

/* DMA_INTC */
#define DMA_INTC_GIFC                     BIT(0)                                                              /*!< clear global interrupt flag of channel */
#define DMA_INTC_FTFIFC                   BIT(1)                                                              /*!< clear transfer finish flag of channel */
#define DMA_INTC_HTFIFC                   BIT(2)                                                              /*!< clear half transfer finish flag of channel */
#define DMA_INTC_ERRIFC                   BIT(3)                                                              /*!< clear error flag of channel */

/* DMA_CHxCTL, x=0..2 */
#define DMA_CHXCTL_CHEN                   BIT(0)                                                              /*!< channel x enable */
#define DMA_CHXCTL_FTFIE                  BIT(1)                                                              /*!< enable bit for channel x transfer complete interrupt */
#define DMA_CHXCTL_HTFIE                  BIT(2)                                                              /*!< enable bit for channel x transfer half complete interrupt */
#define DMA_CHXCTL_ERRIE                  BIT(3)                                                              /*!< enable bit for channel x error interrupt */
#define DMA_CHXCTL_DIR                    BIT(4)                                                              /*!< direction of the data transfer on the channel */
#define DMA_CHXCTL_CMEN                   BIT(5)                                                              /*!< circulation mode */
#define DMA_CHXCTL_PNAGA                  BIT(6)                                                              /*!< next address generation algorithm of peripheral */
#define DMA_CHXCTL_MNAGA                  BIT(7)                                                              /*!< next address generation algorithm of memory */
#define DMA_CHXCTL_PWIDTH                 BITS(8,9)                                                           /*!< transfer data size of peripheral */
#define DMA_CHXCTL_MWIDTH                 BITS(10,11)                                                         /*!< transfer data size of memory */
#define DMA_CHXCTL_PRIO                   BITS(12,13)                                                         /*!< priority level of channelx */
#define DMA_CHXCTL_M2M                    BIT(14)                                                             /*!< memory to memory mode */

/* DMA_CHxCNT, x=0..2 */
#define DMA_CHXCNT_CNT                    BITS(0,15)                                                          /*!< transfer counter */

/* DMA_CHxPADDR, x=0..2 */
#define DMA_CHXPADDR_PADDR                BITS(0,31)                                                          /*!< peripheral base address */

/* DMA_CHxMADDR, x=0..2 */
#define DMA_CHXMADDR_MADDR                BITS(0,31)                                                          /*!< memory base address */

/* DMAMUX_RM_CHxCFG, x=0..2 */
#define DMAMUX_RM_CHXCFG_MUXID            BITS(0,5)                                                           /*!< multiplexer input identification */
#define DMAMUX_RM_CHXCFG_SOIE             BIT(8)                                                              /*!< synchronization overrun interrupt enable */
#define DMAMUX_RM_CHXCFG_EVGEN            BIT(9)                                                              /*!< event generation enable */
#define DMAMUX_RM_CHXCFG_SYNCEN           BIT(16)                                                             /*!< synchronization enable */
#define DMAMUX_RM_CHXCFG_SYNCP            BITS(17,18)                                                         /*!< synchronization input polarity */
#define DMAMUX_RM_CHXCFG_NBR              BITS(19,23)                                                         /*!< number of DMA requests to forward */
#define DMAMUX_RM_CHXCFG_SYNCID           BITS(24,28)                                                         /*!< synchronization input identification */

/* DMAMUX_RM_INTF */
#define DMAMUX_RM_INTF_SOIF0              BIT(0)                                                              /*!< synchronization overrun event flag of request multiplexer channel 0 */
#define DMAMUX_RM_INTF_SOIF1              BIT(1)                                                              /*!< synchronization overrun event flag of request multiplexer channel 1 */
#define DMAMUX_RM_INTF_SOIF2              BIT(2)                                                              /*!< synchronization overrun event flag of request multiplexer channel 2 */

/* DMAMUX_RM_INTC */
#define DMAMUX_RM_INTF_SOIFC0             BIT(0)                                                              /*!< clear bit for synchronization overrun event flag of request multiplexer channel 0 */
#define DMAMUX_RM_INTF_SOIFC1             BIT(1)                                                              /*!< clear bit for synchronization overrun event flag of request multiplexer channel 1 */
#define DMAMUX_RM_INTF_SOIFC2             BIT(2)                                                              /*!< clear bit for synchronization overrun event flag of request multiplexer channel 2 */

/* DMAMUX_RG_CHxCFG, x=0..3 */
#define DMAMUX_RG_CHXCFG_TID              BITS(0,4)                                                           /*!< trigger input identification */
#define DMAMUX_RG_CHXCFG_TOIE             BIT(8)                                                              /*!< trigger overrun interrupt enable */
#define DMAMUX_RG_CHXCFG_RGEN             BIT(16)                                                             /*!< DMA request generator channel x enable */
#define DMAMUX_RG_CHXCFG_RGTP             BITS(17,18)                                                         /*!< DMA request generator trigger polarity */
#define DMAMUX_RG_CHXCFG_NBRG             BITS(19,23)                                                         /*!< number of DMA requests to be generated */

/* DMAMUX_RG_INTF */
#define DMAMUX_RG_INTF_TOIF0              BIT(0)                                                              /*!< trigger overrun event flag of request generator channel 0 */
#define DMAMUX_RG_INTF_TOIF1              BIT(1)                                                              /*!< trigger overrun event flag of request generator channel 1 */
#define DMAMUX_RG_INTF_TOIF2              BIT(2)                                                              /*!< trigger overrun event flag of request generator channel 2 */
#define DMAMUX_RG_INTF_TOIF3              BIT(3)                                                              /*!< trigger overrun event flag of request generator channel 3 */

