zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_dma.h
/* DMA initialization structure */
typedef struct {
    uint32_t periph_addr;                                                                                     /*!< peripheral base address */
    uint32_t periph_width;                                                                                    /*!< transfer data size of peripheral */
    uint32_t memory_addr;                                                                                     /*!< memory base address */
    uint32_t memory_width;                                                                                    /*!< transfer data size of memory */
    uint32_t number;                                                                                          /*!< channel transfer number */
    uint32_t priority;                                                                                        /*!< channel priority level */
    uint8_t periph_inc;                                                                                       /*!< peripheral increasing mode */
    uint8_t memory_inc;                                                                                       /*!< memory increasing mode */
    uint8_t direction;                                                                                        /*!< channel data transfer direction */
    uint32_t request;                                                                                         /*!< channel input identification */
} dma_parameter_struct;

/* DMAMUX request multiplexer synchronization configuration structure */
typedef struct {
    uint32_t sync_id;                                                                                         /*!< synchronization input identification */
    uint32_t sync_polarity;                                                                                   /*!< synchronization input polarity */
    uint32_t request_number;                                                                                  /*!< number of DMA requests to forward */
} dmamux_sync_parameter_struct;

/* DMAMUX request generator trigger configuration structure */
typedef struct {
    uint32_t trigger_id;                                                                                      /*!< trigger input identification */
    uint32_t trigger_polarity;                                                                                /*!< DMAMUX request generator trigger polarity */
    uint32_t request_number;                                                                                  /*!< number of DMA requests to be generated */
} dmamux_gen_parameter_struct;

/* DMA reset value */
#define DMA_CHCTL_RESET_VALUE             ((uint32_t)0x00000000U)                                             /*!< the reset value of DMA channel CHXCTL register */
#define DMA_CHCNT_RESET_VALUE             ((uint32_t)0x00000000U)                                             /*!< the reset value of DMA channel CHXCNT register */
#define DMA_CHPADDR_RESET_VALUE           ((uint32_t)0x00000000U)                                             /*!< the reset value of DMA channel CHXPADDR register */
#define DMA_CHMADDR_RESET_VALUE           ((uint32_t)0x00000000U)                                             /*!< the reset value of DMA channel CHXMADDR register */
#define DMA_CHINTF_RESET_VALUE            (DMA_INTF_GIF | DMA_INTF_FTFIF | \
                                           DMA_INTF_HTFIF | DMA_INTF_ERRIF)                                   /*!< clear DMA channel DMA_INTF register */

#define DMA_FLAG_ADD(flag,shift)          ((flag) << ((uint32_t)(shift) * 4U))                                /*!< DMA channel flag shift */

/* DMA_CHCTL base address */
#define DMA_CHXCTL_BASE                   (DMA + 0x00000008U)                                                 /*!< the base address of DMA channel CHXCTL register */
#define DMA_CHXCNT_BASE                   (DMA + 0x0000000CU)                                                 /*!< the base address of DMA channel CHXCNT register */
#define DMA_CHXPADDR_BASE                 (DMA + 0x00000010U)                                                 /*!< the base address of DMA channel CHXPADDR register */
#define DMA_CHXMADDR_BASE                 (DMA + 0x00000014U)                                                 /*!< the base address of DMA channel CHXMADDR register */

/* DMA channel shift bit */
#define DMA_CHCTL(channel)                REG32(DMA_CHXCTL_BASE + 0x14U * (uint32_t)(channel))                /*!< the address of DMA channel CHXCTL register */
#define DMA_CHCNT(channel)                REG32(DMA_CHXCNT_BASE + 0x14U * (uint32_t)(channel))                /*!< the address of DMA channel CHXCNT register */
#define DMA_CHPADDR(channel)              REG32(DMA_CHXPADDR_BASE + 0x14U * (uint32_t)(channel))              /*!< the address of DMA channel CHXPADDR register */
#define DMA_CHMADDR(channel)              REG32(DMA_CHXMADDR_BASE + 0x14U * (uint32_t)(channel))              /*!< the address of DMA channel CHXMADDR register */

/* DMAMUX_RM_CHxCFG base address */
#define DMAMUX_RM_CHXCFG_BASE             (DMAMUX)                                                            /*!< the base address of DMAMUX request multiplexer channel CHxCFG register */

/* DMAMUX request multiplexer channel shift bit */
#define DMAMUX_RM_CHXCFG(channel)         REG32(DMAMUX_RM_CHXCFG_BASE + 0x04U * (uint32_t)(channel))          /*!< the address of DMAMUX request multiplexer channel CHxCFG register */

/* DMAMUX_RG_CHxCFG base address */
#define DMAMUX_RG_CHXCFG_BASE             (DMAMUX + 0x00000100U)                                              /*!< the base address of DMAMUX channel request generator CHxCFG register */

/* DMAMUX request generator channel shift bit */
#define DMAMUX_RG_CHXCFG(channel)         REG32(DMAMUX_RG_CHXCFG_BASE + 0x04U * (uint32_t)(channel))          /*!< the address of DMAMUX channel request generator CHxCFG register */

/* DMA interrupt flag bits */
#define DMA_INT_FLAG_G                    DMA_INTF_GIF                                                        /*!< global interrupt flag of DMA channel */
#define DMA_INT_FLAG_FTF                  DMA_INTF_FTFIF                                                      /*!< full transfer finish interrupt flag of DMA channel */
#define DMA_INT_FLAG_HTF                  DMA_INTF_HTFIF                                                      /*!< half transfer finish interrupt flag of DMA channel */
#define DMA_INT_FLAG_ERR                  DMA_INTF_ERRIF                                                      /*!< error interrupt flag of DMA channel */

/* DMA flag bits */
#define DMA_FLAG_G                        DMA_INTF_GIF                                                        /*!< global interrupt flag of DMA channel */
#define DMA_FLAG_FTF                      DMA_INTF_FTFIF                                                      /*!< full transfer finish flag of DMA channel */
#define DMA_FLAG_HTF                      DMA_INTF_HTFIF                                                      /*!< half transfer finish flag of DMA channel */
#define DMA_FLAG_ERR                      DMA_INTF_ERRIF                                                      /*!< error flag of DMA channel */

/* DMA interrupt enable bits */
#define DMA_INT_FTF                       DMA_CHXCTL_FTFIE                                                    /*!< enable bit for DMA channel full transfer finish interrupt */
#define DMA_INT_HTF                       DMA_CHXCTL_HTFIE                                                    /*!< enable bit for DMA channel half transfer finish interrupt */
#define DMA_INT_ERR                       DMA_CHXCTL_ERRIE                                                    /*!< enable bit for DMA channel error interrupt */

/* DMA transfer direction */
#define DMA_PERIPHERAL_TO_MEMORY          ((uint8_t)0x00U)                                                    /*!< read from peripheral and write to memory */
#define DMA_MEMORY_TO_PERIPHERAL          ((uint8_t)0x01U)                                                    /*!< read from memory and write to peripheral */

/* DMA peripheral increasing mode */
#define DMA_PERIPH_INCREASE_DISABLE       ((uint8_t)0x00U)                                                    /*!< next address of peripheral is fixed address mode */
#define DMA_PERIPH_INCREASE_ENABLE        ((uint8_t)0x01U)                                                    /*!< next address of peripheral is increasing address mode */

/* DMA memory increasing mode */
#define DMA_MEMORY_INCREASE_DISABLE       ((uint8_t)0x00U)                                                    /*!< next address of memory is fixed address mode */
#define DMA_MEMORY_INCREASE_ENABLE        ((uint8_t)0x01U)                                                    /*!< next address of memory is increasing address mode */

/* DMA transfer data size of peripheral */
#define CHCTL_PWIDTH(regval)              (BITS(8,9) & ((regval) << 8))                                       /*!< transfer data size of peripheral */
#define DMA_PERIPHERAL_WIDTH_8BIT         CHCTL_PWIDTH(0U)                                                    /*!< transfer data size of peripheral is 8-bit */
#define DMA_PERIPHERAL_WIDTH_16BIT        CHCTL_PWIDTH(1U)                                                    /*!< transfer data size of peripheral is 16-bit */
#define DMA_PERIPHERAL_WIDTH_32BIT        CHCTL_PWIDTH(2U)                                                    /*!< transfer data size of peripheral is 32-bit */

/* DMA transfer data size of memory */
#define CHCTL_MWIDTH(regval)              (BITS(10,11) & ((regval) << 10))                                    /*!< transfer data size of memory */
#define DMA_MEMORY_WIDTH_8BIT             CHCTL_MWIDTH(0U)                                                    /*!< transfer data size of memory is 8-bit */
#define DMA_MEMORY_WIDTH_16BIT            CHCTL_MWIDTH(1U)                                                    /*!< transfer data size of memory is 16-bit */
#define DMA_MEMORY_WIDTH_32BIT            CHCTL_MWIDTH(2U)                                                    /*!< transfer data size of memory is 32-bit */

/* DMA channel priority level */
#define CHCTL_PRIO(regval)                (BITS(12,13) & ((regval) << 12))                                    /*!< DMA channel priority level */
#define DMA_PRIORITY_LOW                  CHCTL_PRIO(0U)                                                      /*!< low priority */
#define DMA_PRIORITY_MEDIUM               CHCTL_PRIO(1U)                                                      /*!< medium priority */
#define DMA_PRIORITY_HIGH                 CHCTL_PRIO(2U)                                                      /*!< high priority */
#define DMA_PRIORITY_ULTRA_HIGH           CHCTL_PRIO(3U)                                                      /*!< ultra high priority */

/* DMA transfer counter */
#define DMA_CHANNEL_CNT_MASK              DMA_CHXCNT_CNT                                                      /*!< transfer counter mask */

/* DMAMUX request multiplexer channel input identification */
#define RM_CHXCFG_MUXID(regval)           (BITS(0,5) & ((regval) << 0))                                       /*!< multiplexer input identification */
#define DMA_REQUEST_M2M                   RM_CHXCFG_MUXID(0U)                                                 /*!< memory to memory transfer */
#define DMA_REQUEST_GENERATOR0            RM_CHXCFG_MUXID(1U)                                                 /*!< DMAMUX request generator 0 */
#define DMA_REQUEST_GENERATOR1            RM_CHXCFG_MUXID(2U)                                                 /*!< DMAMUX request generator 1 */
#define DMA_REQUEST_GENERATOR2            RM_CHXCFG_MUXID(3U)                                                 /*!< DMAMUX request generator 2 */
#define DMA_REQUEST_GENERATOR3            RM_CHXCFG_MUXID(4U)                                                 /*!< DMAMUX request generator 3 */
#define DMA_REQUEST_ADC                   RM_CHXCFG_MUXID(5U)                                                 /*!< DMAMUX ADC request */
#define DMA_REQUEST_I2C0_RX               RM_CHXCFG_MUXID(10U)                                                /*!< DMAMUX I2C0 RX request */
#define DMA_REQUEST_I2C0_TX               RM_CHXCFG_MUXID(11U)                                                /*!< DMAMUX I2C0 TX request */
#define DMA_REQUEST_I2C1_RX               RM_CHXCFG_MUXID(12U)                                                /*!< DMAMUX I2C1 RX request */
#define DMA_REQUEST_I2C1_TX               RM_CHXCFG_MUXID(13U)                                                /*!< DMAMUX I2C1 TX request */
#define DMA_REQUEST_SPI0_RX               RM_CHXCFG_MUXID(16U)                                                /*!< DMAMUX SPI0 RX request */
#define DMA_REQUEST_SPI0_TX               RM_CHXCFG_MUXID(17U)                                                /*!< DMAMUX SPI0 TX request */
#define DMA_REQUEST_SPI1_RX               RM_CHXCFG_MUXID(18U)                                                /*!< DMAMUX SPI1 RX request */
#define DMA_REQUEST_SPI1_TX               RM_CHXCFG_MUXID(19U)                                                /*!< DMAMUX SPI1 TX request */
#define DMA_REQUEST_TIMER0_CH0            RM_CHXCFG_MUXID(20U)                                                /*!< DMAMUX TIMER0 CH0 request */
#define DMA_REQUEST_TIMER0_CH1            RM_CHXCFG_MUXID(21U)                                                /*!< DMAMUX TIMER0 CH1 request */
#define DMA_REQUEST_TIMER0_CH2            RM_CHXCFG_MUXID(22U)                                                /*!< DMAMUX TIMER0 CH2 request */
#define DMA_REQUEST_TIMER0_CH3            RM_CHXCFG_MUXID(23U)                                                /*!< DMAMUX TIMER0 CH3 request */
#define DMA_REQUEST_TIMER0_TRIG           RM_CHXCFG_MUXID(24U)                                                /*!< DMAMUX TIMER0 TRIG request */
#define DMA_REQUEST_TIMER0_UP             RM_CHXCFG_MUXID(25U)                                                /*!< DMAMUX TIMER0 UP request */
#define DMA_REQUEST_TIMER0_COM            RM_CHXCFG_MUXID(26U)                                                /*!< DMAMUX TIMER0 COM request */
#define DMA_REQUEST_TIMER2_CH0            RM_CHXCFG_MUXID(32U)                                                /*!< DMAMUX TIMER2 CH0 request */
#define DMA_REQUEST_TIMER2_CH1            RM_CHXCFG_MUXID(33U)                                                /*!< DMAMUX TIMER2 CH1 request */
#define DMA_REQUEST_TIMER2_CH2            RM_CHXCFG_MUXID(34U)                                                /*!< DMAMUX TIMER2 CH2 request */
#define DMA_REQUEST_TIMER2_CH3            RM_CHXCFG_MUXID(35U)                                                /*!< DMAMUX TIMER2 CH3 request */
#define DMA_REQUEST_TIMER2_TRIG           RM_CHXCFG_MUXID(36U)                                                /*!< DMAMUX TIMER2 TRIG request */
#define DMA_REQUEST_TIMER2_UP             RM_CHXCFG_MUXID(37U)                                                /*!< DMAMUX TIMER2 UP request */
#define DMA_REQUEST_TIMER15_CH0           RM_CHXCFG_MUXID(44U)                                                /*!< DMAMUX TIMER15 CH0 request */
#define DMA_REQUEST_TIMER15_UP            RM_CHXCFG_MUXID(46U)                                                /*!< DMAMUX TIMER15 UP request */
#define DMA_REQUEST_TIMER16_CH0           RM_CHXCFG_MUXID(47U)                                                /*!< DMAMUX TIMER16 CH0 request */
#define DMA_REQUEST_TIMER16_UP            RM_CHXCFG_MUXID(49U)                                                /*!< DMAMUX TIMER16 UP request */
#define DMA_REQUEST_USART0_RX             RM_CHXCFG_MUXID(50U)                                                /*!< DMAMUX USART0 RX request */
#define DMA_REQUEST_USART0_TX             RM_CHXCFG_MUXID(51U)                                                /*!< DMAMUX USART0 TX request */
#define DMA_REQUEST_USART1_RX             RM_CHXCFG_MUXID(52U)                                                /*!< DMAMUX USART1 RX request */
#define DMA_REQUEST_USART1_TX             RM_CHXCFG_MUXID(53U)                                                /*!< DMAMUX USART1 TX request */
#define DMA_REQUEST_USART2_RX             RM_CHXCFG_MUXID(54U)                                                /*!< DMAMUX USART3 RX request */
#define DMA_REQUEST_USART2_TX             RM_CHXCFG_MUXID(55U)                                                /*!< DMAMUX USART3 TX request */

/* DMAMUX request generator trigger input identification */
#define RG_CHXCFG_TID(regval)             (BITS(0,4) & ((regval) << 0))                                       /*!< trigger input identification */
#define DMAMUX_TRIGGER_EXTI0              RG_CHXCFG_TID(0U)                                                   /*!< trigger input is EXTI0 */
#define DMAMUX_TRIGGER_EXTI1              RG_CHXCFG_TID(1U)                                                   /*!< trigger input is EXTI1 */
#define DMAMUX_TRIGGER_EXTI2              RG_CHXCFG_TID(2U)                                                   /*!< trigger input is EXTI2 */
#define DMAMUX_TRIGGER_EXTI3              RG_CHXCFG_TID(3U)                                                   /*!< trigger input is EXTI3 */
#define DMAMUX_TRIGGER_EXTI4              RG_CHXCFG_TID(4U)                                                   /*!< trigger input is EXTI4 */
#define DMAMUX_TRIGGER_EXTI5              RG_CHXCFG_TID(5U)                                                   /*!< trigger input is EXTI5 */
#define DMAMUX_TRIGGER_EXTI6              RG_CHXCFG_TID(6U)                                                   /*!< trigger input is EXTI6 */
#define DMAMUX_TRIGGER_EXTI7              RG_CHXCFG_TID(7U)                                                   /*!< trigger input is EXTI7 */
#define DMAMUX_TRIGGER_EXTI8              RG_CHXCFG_TID(8U)                                                   /*!< trigger input is EXTI8 */
#define DMAMUX_TRIGGER_EXTI9              RG_CHXCFG_TID(9U)                                                   /*!< trigger input is EXTI9 */
#define DMAMUX_TRIGGER_EXTI10             RG_CHXCFG_TID(10U)                                                  /*!< trigger input is EXTI10 */
#define DMAMUX_TRIGGER_EXTI11             RG_CHXCFG_TID(11U)                                                  /*!< trigger input is EXTI11 */
#define DMAMUX_TRIGGER_EXTI12             RG_CHXCFG_TID(12U)                                                  /*!< trigger input is EXTI12 */
#define DMAMUX_TRIGGER_EXTI13             RG_CHXCFG_TID(13U)                                                  /*!< trigger input is EXTI13 */
#define DMAMUX_TRIGGER_EXTI14             RG_CHXCFG_TID(14U)                                                  /*!< trigger input is EXTI14 */
#define DMAMUX_TRIGGER_EXTI15             RG_CHXCFG_TID(15U)                                                  /*!< trigger input is EXTI15 */
#define DMAMUX_TRIGGER_EVT0_OUT           RG_CHXCFG_TID(16U)                                                  /*!< trigger input is Evt0_out */
#define DMAMUX_TRIGGER_EVT1_OUT           RG_CHXCFG_TID(17U)                                                  /*!< trigger input is Evt1_out */
#define DMAMUX_TRIGGER_EVT2_OUT           RG_CHXCFG_TID(18U)                                                  /*!< trigger input is Evt2_out */
#define DMAMUX_TRIGGER_TIMER13_O          RG_CHXCFG_TID(21U)                                                  /*!< trigger input is TIMER13 O */

